surfaceWater/runCases/LES_3D_zeroStart/constant/g
//     t      acc    omega   dOmegadt
(
    ( 0.0      ((-1.3514e-3 0 0) (0 0 0) (0 0 0)))
    ( 100000.0  ((-1.3514e-3 0 0) (0 0 0) (0 0 0)))
);
