surfaceWater/runCases/LES_3D_zeroStart/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          binary;
    class           polyBoundaryMesh;
    location        "constant/polyMesh";
    object          boundary;
}


6 // entry0
(
    back
    {
        type            wall;
        physicalType    wall;
        nFaces          2401;
        startFace       274694;
    }
    front
    {
        type            wall;
        physicalType    wall;
        nFaces          2401;
        startFace       277095;
    }
    bottom
    {
        type            wall;
        physicalType    wall;
        nFaces          1911;
        startFace       279496;
    }
    right
    {
        type            cyclicAMI;
        nFaces          1911;
        startFace       281407;
        transform       translational;
        neighbourPatch  left;
        separationVector ( -0.15 0 0 );
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          1911;
        startFace       283318;
    }
    left
    {
        type            cyclicAMI;
        nFaces          1911;
        startFace       285229;
        transform       translational;
        neighbourPatch  right;
        separationVector ( 0.15 0 0 );
    }
)


// ************************************************************************* //
