surfaceWater/runCases/LES_3D_zeroStart/system/boundaryProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a specified list of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

fields (p);

points
(
(0 0 0)
(0 0 0.0193333)
(0 0 0.0386667)
(0 0 0.058)
(0 0 0.0773333)
(0 0 0.0966667)
(0 0 0.116)
(0 0 0.135333)
(0 0 0.154667)
(0 0 0.174)
(0 0 0.193333)
(0 0 0.212667)
(0 0 0.232)
(0 0 0.251333)
(0 0 0.270667)
(0 0 0.29)
(0.00303742 0.000494608 0)
(0.00303742 0.000494608 0.0193333)
(0.00303742 0.000494608 0.0386667)
(0.00303742 0.000494608 0.058)
(0.00303742 0.000494608 0.0773333)
(0.00303742 0.000494608 0.0966667)
(0.00303742 0.000494608 0.116)
(0.00303742 0.000494608 0.135333)
(0.00303742 0.000494608 0.154667)
(0.00303742 0.000494608 0.174)
(0.00303742 0.000494608 0.193333)
(0.00303742 0.000494608 0.212667)
(0.00303742 0.000494608 0.232)
(0.00303742 0.000494608 0.251333)
(0.00303742 0.000494608 0.270667)
(0.00303742 0.000494608 0.29)
(0.00606345 0.0010549 0)
(0.00606345 0.0010549 0.0193333)
(0.00606345 0.0010549 0.0386667)
(0.00606345 0.0010549 0.058)
(0.00606345 0.0010549 0.0773333)
(0.00606345 0.0010549 0.0966667)
(0.00606345 0.0010549 0.116)
(0.00606345 0.0010549 0.135333)
(0.00606345 0.0010549 0.154667)
(0.00606345 0.0010549 0.174)
(0.00606345 0.0010549 0.193333)
(0.00606345 0.0010549 0.212667)
(0.00606345 0.0010549 0.232)
(0.00606345 0.0010549 0.251333)
(0.00606345 0.0010549 0.270667)
(0.00606345 0.0010549 0.29)
(0.00907973 0.00166558 0)
(0.00907973 0.00166558 0.0193333)
(0.00907973 0.00166558 0.0386667)
(0.00907973 0.00166558 0.058)
(0.00907973 0.00166558 0.0773333)
(0.00907973 0.00166558 0.0966667)
(0.00907973 0.00166558 0.116)
(0.00907973 0.00166558 0.135333)
(0.00907973 0.00166558 0.154667)
(0.00907973 0.00166558 0.174)
(0.00907973 0.00166558 0.193333)
(0.00907973 0.00166558 0.212667)
(0.00907973 0.00166558 0.232)
(0.00907973 0.00166558 0.251333)
(0.00907973 0.00166558 0.270667)
(0.00907973 0.00166558 0.29)
(0.0120886 0.0023119 0)
(0.0120886 0.0023119 0.0193333)
(0.0120886 0.0023119 0.0386667)
(0.0120886 0.0023119 0.058)
(0.0120886 0.0023119 0.0773333)
(0.0120886 0.0023119 0.0966667)
(0.0120886 0.0023119 0.116)
(0.0120886 0.0023119 0.135333)
(0.0120886 0.0023119 0.154667)
(0.0120886 0.0023119 0.174)
(0.0120886 0.0023119 0.193333)
(0.0120886 0.0023119 0.212667)
(0.0120886 0.0023119 0.232)
(0.0120886 0.0023119 0.251333)
(0.0120886 0.0023119 0.270667)
(0.0120886 0.0023119 0.29)
(0.0150928 0.00297956 0)
(0.0150928 0.00297956 0.0193333)
(0.0150928 0.00297956 0.0386667)
(0.0150928 0.00297956 0.058)
(0.0150928 0.00297956 0.0773333)
(0.0150928 0.00297956 0.0966667)
(0.0150928 0.00297956 0.116)
(0.0150928 0.00297956 0.135333)
(0.0150928 0.00297956 0.154667)
(0.0150928 0.00297956 0.174)
(0.0150928 0.00297956 0.193333)
(0.0150928 0.00297956 0.212667)
(0.0150928 0.00297956 0.232)
(0.0150928 0.00297956 0.251333)
(0.0150928 0.00297956 0.270667)
(0.0150928 0.00297956 0.29)
(0.0180954 0.00365453 0)
(0.0180954 0.00365453 0.0193333)
(0.0180954 0.00365453 0.0386667)
...
(0.15 0 0.29)

);

maxDistance 0.01;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

interpolationScheme cell;
setFormat raw;

patches     ("bottom");

#includeEtc "caseDicts/postProcessing/probes/boundaryProbes.cfg"

executeControl  timeStep;
writeControl	timeStep;
writeInterval	1;


// ************************************************************************* //
